<?php

ob_start();
/*
 * NOTE: 
 * tcpdfは日本語に対応していないため、ホワイトスペースの調整が必要で、下記処理が必須になります。
 * 
 * 以下に、/m_m1/Agreements2e.html, /m_m1/Agreements2j.htmlの
 * 規約部分のhtml（<div class="formset" id="Agreements2">～</div>）を挿入し
 * /test-dir/tcpdf/exchange/ にアクセスすると
 * /m_m1/Agreements2e_print.html, /m_m1/Agreements2j_print.html 用のbody内の条文部分のhtmlを取得可能
 * 
 * 取得したhtmlを/m_m1/Agreements2e_print.html, /m_m1/Agreements2j_print.html の
 * 正しい位置に手作業で貼り付けてテンプレートの完成
 * 
 * 
 * WARNING:	
 * バリデーターは入っていません。正しいHTMLを挿入してください。
 * <div class="formset" id="Agreements2">～</div>　にはデフォルトではformなど不要な要素を含むため除去が必要
 * 
*/
?>

                    <div class="formset" id="Agreements2">
                        <h2 class="formset_h2">Scientist<span>3</span> サプライヤー向けサービス規約</h2>
                        <p class="formset_lead"><span>第1章</span>目的及び定義</p>
                        <p class="formset_mid"><span>第1.1条</span> （目的及び適用範囲）</p>
                        <p class="formset_txt mb2">
                            このサプライヤー向けサービス規約（以下「<strong>本規約</strong>」という。）は、コスモ・バイオ株式会社（以下「<strong>コスモ・バイオ</strong>」という。）が「Scientist<span
                                class="txt_up">3</span>」の名称で運営するプラットフォーム（以下「<strong>本プラットフォーム</strong>」という。）及びこれに付随するサービス（本プラットフォームと合わせて、以下「<strong>PFサービス</strong>」という。）のサプライヤーによる利用に関し、コスモ・バイオ及びサプライヤー間に適用される取引条件を定めることを目的とし、当該利用すべてに適用される。
                        </p>
                        <p class="formset_mid"><span>第1.2条</span>（定義）</p>
                        <p class="formset_txt">本規約において、次の各号に掲げる用語の意味は当該各号の定めるところによる。</p>
                        <ul class="formset_list_01 mb2">
                            <li>(1) 「<strong>サプライヤーサービス</strong>」とは、本プラットフォームを介してクライアントが委託し、サプライヤーが受託するサービスをいう。</li>
                            <li>(2)「<strong>クライアント</strong>」とは、サプライヤーサービスを委託する法人又は個人事業主をいう。</li>
                            <li>(3)「<strong>サプライヤー</strong>」とは、コスモ・バイオが定める方法により、本プラットフォームにおけるサプライヤーとして登録した法人又は個人事業主であって、サプライヤーサービスを受託する者をいう。
                            </li>
                            <li>(4)「<strong>当事者</strong>」とは、コスモ・バイオ及びサプライヤーを合わせて、又は個別にいう。</li>
                            <li>(5)「<strong>プラットフォーム利用規約</strong>」とは、コスモ・バイオが別途定める本プラットフォームの利用に際して遵守すべき条件を定めた規約であり、<a href="https://scientist3.ms123.jp/terms/">[https://scientist3.ms123.jp/terms/]</a>に掲載されたものをいう。
                            </li>
                            <li>(6)「<strong>サプライヤーサービス契約</strong>」とは、クライアント及びサプライヤー間でサプライヤーサービス契約条項に基づいて締結されるサプライヤーサービスに関する契約をいう。
                            </li>
                            <li>(7)「<strong>サプライヤーサービス契約条項</strong>」とは、サプライヤー及びクライアント間に適用される取引条件を定める条項の総体であり、<a href="https://scientist3.ms123.jp/m_m1/?param=Agreements3j">[https://scientist3.ms123.jp/m_m1/?param=Agreements3j]</a>に掲載されたものをいう。
                            </li>
                            <li>(8)「<strong>サプライヤーサービス利用料</strong>」とは、その名称を問わず、サプライヤーサービスに関連してクライアントがサプライヤーに対して支払う一切の対価及び費用を総称していう。
                            </li>
                            <li>(9)「<strong>CB手数料</strong>」とは、クライアントとサプライヤーとの間の取引に関連して、クライアントがコスモ・バイオに支払うべき手数料をいう。CB手数料には、サプライヤーサービス利用時における本プラットフォームの利用手数料、及び、サプライヤーサービスにおいて実施される業務の用に供する材料の送付又は成果物の受領（コスモ・バイオが、サプライヤーから受け取った成果物を、クライアントに対して送付する業務を含む。）をコスモ・バイオが代行する場合における送付代行手数料が含まれる。
                            </li>
                        </ul>
                        <p class="formset_lead"><span>第2章</span>PFサービスの利用</p>
                        <p class="formset_mid"><span>第2.1条</span>（PFサービスの目的）</p>
                        <p class="formset_txt mb2">
                            PFサービスは、サプライヤーサービスに関して、発注先の選定、見積りの作成依頼、見積りの提示、発注手続、請求手続、支払等のサプライヤー及びクライアントにおける一連の業務を円滑化することを目的としたサービスである。
                        </p>
                        <p class="formset_mid"><span>第2.2条</span>（サプライヤー登録申込）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. サプライヤーとなることを希望する者は、本規約の内容に同意した上で、コスモ・バイオ所定の方法により、サプライヤー登録の申込を行うものとする。</li>
                            <li>2.
                                コスモ・バイオが当該申込を承諾した時点で、サプライヤー登録の申込をした者（以下「<strong>登録申込者</strong>」という。）とコスモ・バイオの間でPFサービスの利用に関する契約（以下「<strong>PFサービス利用契約</strong>」という。）が成立し、当該登録申込者は、サプライヤーとなる。
                            </li>
                            <li>3. サプライヤーは、本プラットフォームに登録している情報の内容に変更が生じた場合には、直ちに本プラットフォーム上で登録情報の更新を行うものとする。</li>
                        </ul>
                        <p class="formset_mid"><span>第2.3条</span>（サプライヤー登録申込の不承諾）</p>
                        <p class="formset_txt">コスモ・バイオは、次の各号のいずれかに該当し、又は該当するおそれがあると判断する場合は、登録申込者のPFサービスの利用申込を承諾しないことがある。
                        </p>
                        <ul class="formset_list_01 mb2">
                            <li>(1) 登録申込者が、コスモ・バイオが本プラットフォーム上で登録申込者に認識可能な方法により表示するサプライヤー基準を満たさない場合</li>
                            <li>(2) 登録申込者が、前条第1項の方法によらずにサプライヤー登録の申込を行った場合</li>
                            <li>(3) 登録申込者が、過去に本規約その他のコスモ・バイオが定める規約等に違反したことを理由として強制登録解除処分を受けた者である場合</li>
                            <li>(4) 登録された情報が虚偽又は不正確である場合</li>
                            <li>(5) 登録申込者が、PFサービスと競合する事業を営む場合</li>
                            <li>(6) 登録申込者が反社会的勢力の構成員若しくはその関係者である場合</li>
                            <li>(7) その他コスモ・バイオが登録申込者をサプライヤーとして登録することを不適切と判断した場合</li>
                        </ul>
                        <p class="formset_mid"><span>第2.4条</span>（サプライヤー登録解除）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1.
                                サプライヤーがサプライヤーの登録解除を希望する場合には、コスモ・バイオ所定の方法により、コスモ・バイオに登録解除の申出を行うものとする。コスモ・バイオは、存続中のサプライヤーサービス契約が存在する場合その他登録解除を行うことが適当ではないと判断した場合には、登録解除を延期することができるものとする。
                            </li>
                            <li> 2. コスモ・バイオは、サプライヤーが次の各号のいずれかに該当した場合には、強制的に登録解除するとともに、その後一切の本プラットフォームの利用を拒否することができる。
                                <ul class="formset_list_02">
                                    <li>(1) 前条各号のいずれかに該当することが判明した場合</li>
                                    <li>(2) サプライヤー登録時点で、前条各号のいずれかに該当していたことが明らかとなった場合</li>
                                    <li>(3) 本規約その他のコスモ・バイオが定める規約等に違反した場合</li>
                                    <li>(4) その他コスモ・バイオがサプライヤーとしての登録を継続することを不適切と判断した場合</li>
                                </ul>
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第2.5条</span>（PFサービスの利用）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. PFサービス利用契約は、本規約及びプラットフォーム利用規約に定める条件をその内容とし、サプライヤーは当該各規約に従う限りにおいて、PFサービスを利用することができる。
                            </li>
                            <li>2.
                                サプライヤーは、PFサービスの利用に際してプラットフォーム利用規約を自ら遵守するほか、サプライヤーの従業員その他サプライヤーのためにPFサービスを利用する個人をして、プラットフォーム利用規約を遵守させる。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第2.6条</span>（PFサービスの利用料）</p>
                        <p class="formset_txt mb2">サプライヤーは、PFサービスを無償で利用することができる。</p>
                        <p class="formset_lead"><span>第3章</span>サプライヤーサービスの実施</p>
                        <p class="formset_mid"><span>第3.1条</span>（本プラットフォームの利用義務等）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1.
                                サプライヤーは、クライアントから本プラットフォーム上でサプライヤーサービス利用料の見積依頼を受けた場合その他本プラットフォームを利用したことによってクライアントとの取引の機会を得た場合には、サプライヤーサービス契約条項に基づき、本プラットフォームを通じてサプライヤーサービスを提供しなければならない。サプライヤーが本項の義務に違反してサービスを提供した場合、コスモ・バイオは、サプライヤーに対し、当該義務が履行されたときに、当該取引に関連してクライアントがコスモ・バイオに支払うべきであったCB手数料に相当する金額を請求することができる。本項の定めは、サプライヤーによる本項の義務の違反に関連するコスモ・バイオのサプライヤーに対する損害賠償請求を妨げない。
                            </li>
                            <li> 2.
                                サプライヤーは、クライアントから、サプライヤーサービスに関し、サプライヤーサービス契約条項第2.1条第2項に基づいて作成する見積書/SOWに記載されていない金銭その他の対価の支払を受けてはならない。サプライヤーが本項に違反して当該支払を受けた場合、コスモ・バイオは、サプライヤーに対し、当該対価に対応する金額のCB手数料を請求することができる。本項の定めは、サプライヤーによる本項の義務の違反に関連するコスモ・バイオのサプライヤーに対する損害賠償請求を妨げない。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第3.2条</span>（サプライヤーサービス契約条項の締結）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. サプライヤーは、本規約に同意することにより、サプライヤーサービス契約条項にも同意したものとみなす。</li>
                            <li>2.
                                サプライヤーは、本規約、プラットフォーム利用規約その他コスモ・バイオが本プラットフォームに関して定める規約、規則等（サプライヤーサービス契約条項第3章及び第4章を除く。）に違反し、又は矛盾抵触する条件をサプライヤーサービス契約の内容とすることはできない。
                            </li>
                            <li>3.
                                コスモ・バイオは、いつでも、サプライヤーサービス契約条項を改定することができる。この場合、コスモ・バイオは、サプライヤーに対し、あらかじめ、当該改定の内容と当該改定の効力発生日を通知する。当該改定は、当該効力発生日以降に成立するサプライヤーサービスにのみ適用されるものとし、当該効力発生日までに成立したサプライヤーサービス契約には影響を与えない。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第3.3条</span>（サプライヤーサービス契約に関する責任）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. サプライヤーサービス契約は、クライアント及びサプライヤーの間で締結されるものであり、コスモ・バイオはサプライヤーサービス契約に関して何らの責任も負わない。</li>
                            <li>2.
                                サプライヤーは、コスモ・バイオに対し、サプライヤーサービス契約条項及びこれに基づき成立することとなるサプライヤーサービス契約に定められたサプライヤーの義務を遵守することを誓約する。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第3.4条</span>（受発注）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. コスモ・バイオ及びサプライヤーは、サプライヤーサービス契約条項第2.1条（受発注）に従い、本プラットフォーム上でサプライヤーサービスに係る受発注手続を実施する。</li>
                            <li>2.
                                サプライヤーは、コスモ・バイオがサプライヤーサービス契約条項第2.1条第3項に基づいてクライアントに提示するCB見積書には、サプライヤーが見積書に記載した見積金額に加え、クライアントがコスモ・バイオに対して支払うべき手数料が含まれることを承諾する。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第3.5条</span>（サプライヤーサービス利用料の代理受領）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. コスモ・バイオ及びサプライヤーは、サプライヤーサービス契約条項第3.2条（支払）に従い、本プラットフォーム上でサプライヤーサービスに係る支払手続を実施する。</li>
                            <li>2.
                                サプライヤーサービス契約条項第3.2条第3項及び同条第5項において、本規約で定めることとされている通貨は、円、米ドル、ユーロ又は英ポンドのうち、サプライヤーがサプライヤー登録時に指定したものとする。
                            </li>
                            <li>3.
                                サプライヤーは、コスモ・バイオに対し、サプライヤーに代わってサプライヤーサービス利用料を受領する権限を付与する。クライアントのサプライヤーサービス利用料の支払義務は、コスモ・バイオがこれを受領したときに消滅するものとする。
                            </li>
                            <li>4. サプライヤーは、サプライヤーサービス契約条項第3.2条と異なり、又はこれと矛盾抵触する内容をクライアントと合意してはならない。</li>
                        </ul>
                        <p class="formset_mid"><span>第3.6条</span>（変更・解約）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. サプライヤーサービス利用料が変更される場合、コスモ・バイオ及びサプライヤーは、サプライヤーサービス契約条項第3.4条第2項に従い、当該変更に係る手続を実施する。</li>
                            <li>2.
                                サプライヤーサービス契約の一部又は全部が解約された場合、コスモ・バイオ及びサプライヤーは、サプライヤーサービス契約条項第3.4条第5項に従い、当該解約までの間に既にした履行の割合に応じたサプライヤーサービス利用料の請求に係る支払手続を実施する。当該解約に伴い、クライアントが既に支払った費用の返金が発生した場合、コスモ・バイオ及びサプライヤーは、サプライヤーサービス契約条項第3.4条第6項に従い、当該返金に係る手続を実施する。
                            </li>
                        </ul>
                        <p class="formset_lead"><span>第4章</span>一般条項</p>
                        <p class="formset_mid"><span>第4.1条</span>（通知）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1.
                                コスモ・バイオからサプライヤーへの本規約に関する通知は、電子メールによる方法その他コスモ・バイオの定める方法によって行う。当該通知は、コスモ・バイオからの発信によってその効力が生ずる。
                            </li>
                            <li>2. サプライヤーからコスモ・バイオへの本規約に関する通知は、本プラットフォーム上その他コスモ・バイオの定める方法によって行う。</li>
                        </ul>
                        <p class="formset_mid"><span>第4.2条</span>（秘密保持）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1.
                                本規約において、「<strong>秘密情報</strong>」とは、一方当事者（以下「<strong>開示当事者</strong>」という。）が他方当事者（以下「<strong>受領当事者</strong>」という。）に対して開示した情報のうち、次の各号に掲げるもの（いずれも複製を含む。）をいう。
                                <ul class="formset_list_02">
                                    <li>(1)見積書、SOWその他の本プラットフォームを通じて開示したサプライヤーサービスに関する書面（電磁的記録を含む。以下同じ。）の内容並びにサプライヤーが本プラットフォームに入力、アップロードするなどして開示した情報
                                    </li>
                                    <li>(2)口頭、書面等開示の形式を問わず、開示当事者が秘密である旨を明示して受領当事者に開示した情報</li>
                                </ul>
                            </li>
                            <li>2. 前項にかかわらず、同項第2号の情報のうち、次の各号のいずれかに該当する情報は、秘密情報に該当しない。
                                <ul class="formset_list_02">
                                    <li>(1)開示された時点において既に公知であったもの</li>
                                    <li>(2)開示された後、受領当事者の責によらず公知となったもの</li>
                                    <li>(3)開示された時点において既に受領当事者が了知していたもの</li>
                                    <li>(4)受領当事者が、守秘義務を負うことなく正当な開示権限を有する第三者から適法に入手したもの</li>
                                    <li>(5)開示された後、PFサービスに関与していない受領当事者の役員又は従業員が秘密情報にアクセスすることなく独自に開発したもの</li>
                                </ul>
                            </li>
                            <li>3.
                                各当事者は、秘密情報について厳重に保持し、PFサービス利用契約の履行以外の目的に使用してはならないものとする。各当事者は、PFサービス利用契約の履行のために知る必要がある自己の役員及び従業員以外の第三者に対し、相手方の書面による承諾なく秘密情報を開示してはならない。ただし、各当事者は、弁護士、公認会計士、税理士その他の法令上の守秘義務を負う者に対しては、秘密情報を開示することができる。
                            </li>
                            <li>4.
                                前項の定めにかかわらず、サプライヤーは、その再委託先に対し、サプライヤーサービスの遂行に必要な範囲で秘密情報を開示することができる。また、コスモ・バイオは、その再委託先に対して、PFサービスの遂行に必要な範囲で秘密情報を開示することができる。サプライヤー及びコスモ・バイオは、自らの再委託先をして、本条の秘密保持義務を遵守させるものとし、自らの再委託先による当該義務への違反について自らが行った場合と同等の責任を負うものとする。
                            </li>
                            <li>5.
                                第3項の定めにかかわらず、各当事者は、法令に基づき裁判所又は行政機関によって秘密情報の開示を求められた場合は、事前に相手方にその旨を通知する（事前に通知することが不可能な場合は、開示後速やかに通知する。）とともに、必要最低限の範囲で開示することができる。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第4.3条</span>（不可抗力）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1.
                                地震、台風、津波その他の天変地異、戦争、暴動、内乱、テロ行為、重大な疾病、法令・規則の制定・改廃、公権力による命令・処分その他の政府による行為、争議行為、輸送機関・通信回線等の事故その他不可抗力によるPFサービス利用契約の全部又は一部（金銭債務を除く。以下本条において同じ。）の履行遅滞又は履行不能については、いずれの当事者もその責任を負わない。
                            </li>
                            <li>2.
                                サプライヤーは、前項に定める事由により、PFサービス利用契約の全部又は一部の履行遅滞又は履行不能となるおそれがある場合には、コスモ・バイオに対してその旨を直ちに書面をもって通知し、その後の対応を協議するものとする。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第4.4条</span>（損害賠償）</p>
                        <p class="formset_txt mb2">
                            サプライヤーは、本規約に違反した場合、又はサプライヤーサービスに関連して自らの故意若しくは過失によりコスモ・バイオに損害を与えた場合には、コスモ・バイオがこれによって被った損害（弁護士費用を含むが、これに限られない。）を賠償しなければならない。
                        </p>
                        <p class="formset_mid"><span>第4.5条</span>（第三者に及ぼした損害）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1.
                                サプライヤーは、自らの本規約への違反に起因して、又はサプライヤーサービスの提供に関連して、サプライヤー又はコスモ・バイオを対象としたクレーム、提訴その他の紛争が第三者（クライアントを含む。以下同じ。）との間で生じ、又は関係当局による捜査、調査、勧告、命令その他の措置が行われた場合には、自らの費用と責任において当該紛争又は措置を解決又は処理する。これには、第三者に損害を及ぼした損害をサプライヤーの費用で賠償することが含まれる。
                            </li>
                            <li>2. サプライヤーは、前項の第三者との紛争又は関係当局による措置が行われ、又は行われるおそれがあることを認識したときは、コスモ・バイオに対して速やかに連絡する。</li>
                            <li>3.
                                サプライヤーは、第1項の第三者との紛争及び関係当局による措置に関してコスモ・バイオに何らの不利益を与えないものとし、コスモ・バイオに損害（弁護士費用を含むが、これに限られない。）が生じた場合には、直ちに当該損害の一切を補償する。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第4.6条</span>（契約の解約・解除）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. コスモ・バイオ又はサプライヤーは、相手方に対し、90日前までに通知することにより、PFサービス利用契約を解除することができる。</li>
                            <li>2.
                                前項の規定にかかわらず、コスモ・バイオは、サプライヤーに次の各号に掲げる事由のいずれかが生じた場合には、何らの催告を要せず、直ちにPFサービス利用契約を解除することができる。
                                <ul class="formset_list_02">
                                    <li>(1) 本規約、プラットフォーム利用規約、その他コスモ・バイオが本プラットフォームに関して定める規約、規則等に違反したとき。</li>
                                    <li>(2) 第三者から差押え、仮差押え、仮処分、公売処分、租税滞納処分、競売の申立て等の公権力の処分を受けたとき。</li>
                                    <li>(3) 破産手続開始、民事再生手続開始、会社更生手続開始若しくは特別清算手続開始の申立てを受け、又は自ら申立てを行ったとき。</li>
                                    <li>(4) 関係官公庁から営業停止又は営業免許若しくは営業登録の取消しの処分を受けたとき。</li>
                                    <li>(5) 支払停止若しくは支払不能の状態に陥ったとき、又は手形若しくは小切手が不渡りとなったとき。</li>
                                    <li>(6) 資産又は信用状態に重大な変化が生じ、本規約に基づく債務の履行が困難になるおそれがあると認められるとき。</li>
                                    <li>(7) 事業を停止し、若しくはそのおそれがあるとき、又は事業若しくは資産の全部若しくは重要な一部を処分したとき。</li>
                                    <li>(8) 支配権が、本規約締結時とは異なる者に変更されたとき。</li>
                                    <li>(9) 前各号に定めるほか、信頼関係の破壊その他本規約を継続しがたい重大な事由があるとコスモ・バイオが認めたとき。</li>
                                </ul>
                            </li>
                            <li>3. 前項の規定に基づく解除は、コスモ・バイオの損害賠償請求等を妨げない。</li>
                        </ul>
                        <p class="formset_mid"><span>第4.7条</span>（反社会的勢力の排除）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. コスモ・バイオ及びサプライヤーは、相手方に対して以下の事項について表明し、かつ、保証する。
                                <ul class="formset_list_02">
                                    <li>(1)
                                        自ら及び自らの取締役、執行役、監査役若しくはこれらに準ずる者（以下これらを総称して「役員」という。）が暴力団又はこれに類する者等の反社会的勢力又はこれに準ずる者でないこと。
                                    </li>
                                    <li>(2) 自ら及び自らの役員が暴力団又はこれに類する者等の反社会的勢力と密接な関係がないこと。</li>
                                    <li>(3)
                                        自ら又は第三者を利用して、暴力的な要求行為、法的責任を超えた不当な要求行為、脅迫的な言動、風説の流布、偽計又は威力を用いて、相手方の信用を棄損し、又は業務を妨害する行為その他これらに準ずる行為を行わないこと。
                                    </li>
                                </ul>
                            </li>
                            <li>2. コスモ・バイオ及びサプライヤーは、自己が前項各号の一に該当しなくなったことを発見した場合、直ちに相手方にその事実を報告しなければならない。</li>
                            <li>3.
                                コスモ・バイオ及びサプライヤーは、相手方が前2項の一に違反した場合又は前項の報告を受けた場合、催告その他何らの手続を要することなく直ちにPFサービス利用契約の全部又は一部を解除することができるものとし、当該解除により被った損害の賠償を相手方に請求することができるものとする。一方、解除された当事者は、当該解除により被った損害について、相手方に対して一切の請求を行わないものとする。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第4.8条</span>（有効期間及び存続条項）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. PFサービス利用契約は、PFサービス利用契約締結日に発効し、本規約の規定に従い終了しない限り、有効に存続する。</li>
                            <li>2. PFサービス利用契約が終了した場合であっても、当該終了時点までに成立したサプライヤーサービス契約については、PFサービス利用契約の条件が適用される。</li>
                            <li>3.
                                PFサービス利用契約の終了事由の如何にかかわらず、第4.2条（秘密保持）及び第4.11条（協議）に定める条件はPFサービス利用契約の終了後5年間、第4.4条（損害賠償）、第4.5条（第三者に及ぼした損害）、本条、第4.12条（分離可能性）、第4.13条（準拠法）及び第4.14条（紛争解決・合意管轄）は、該当する事項が存続する限り、有効に存続し、コスモ・バイオ及びサプライヤーを拘束する。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第4.9条</span>（本規約の変更）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1.
                                コスモ・バイオは、次の各号のいずれかに該当する場合、本プラットフォームへの掲載、電子メールの送信その他コスモ・バイオが適切と判断した方法によって公表又は通知することにより、本規約の内容を変更することができる。
                                <ul class="formset_list_02">
                                    <li>(1) 本規約の変更が、サプライヤーへの一般の利益に適合するとき。</li>
                                    <li>(2) 本規約の変更が、本規約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性、変更の内容その他の変更に係る事情に照らして合理的なものであるとき。
                                    </li>
                                </ul>
                            </li>
                            <li>2.
                                前項に掲げる場合に該当しないときでも、コスモ・バイオは、前項に定める方法による公表又は通知の上、サプライヤーから事前の承諾を得ることにより、本規約を随時変更することができる。サプライヤーは、本規約の変更後に本プラットフォームを利用することにより、変更後の利用規約を承諾したものとみなされるものとする。
                            </li>
                            <li>3.
                                前二項の規定による本規約の変更は、当該公表又は通知において定めた変更日以降、将来に向かってのみその効力を生ずる。
                            </li>
                        </ul>
                        <p class="formset_mid"><span>第4.10条</span>（権利義務の譲渡禁止）</p>
                        <p class="formset_txt mb2">
                            サプライヤーは、コスモ・バイオの事前の書面による承諾がない限り、PFサービス利用契約上の地位又はこれらに基づく権利若しくは義務を第三者に譲渡し、担保に供し、又はその他の処分をしてはならない。
                        </p>
                        <p class="formset_mid"><span>第4.11条</span>（協議）</p>
                        <p class="formset_txt mb2">
                            本規約に定めのない事項又は本規約の条文の解釈に疑義を生じた事項については、コスモ・バイオ及びサプライヤーは、誠意をもって協議しこれを解決するものとする。</p>
                        <p class="formset_mid"><span>第4.12条</span>（分離可能性）</p>
                        <p class="formset_txt mb2">
                            本規約のいずれかの規定又はその適用が、管轄裁判所又はその他の政府機関によって違法、無効又は執行不能であると宣言された場合でも、本規約の残りの規定は引き続き完全に効力を有し、かかる規定の適用が継続される。
                        </p>
                        <p class="formset_mid"><span>第4.13条</span>（準拠法）</p>
                        <p class="formset_txt mb2">本規約の準拠法は日本法とする。</p>
                        <p class="formset_mid"><span>第4.14条</span>（紛争解決・合意管轄）</p>
                        <ul class="formset_list_02 mb2">
                            <li>1. コスモ・バイオ及びサプライヤーは、本規約に関連して生じた紛争について、友好的に解決するために、合理的な努力を払う。</li>
                            <li>2. コスモ・バイオ及びサプライヤーは、本規約に関する一切の訴訟について、東京地方裁判所を第一審の専属的合意管轄裁判所とすることに合意する。</li>
                        </ul>
                        <p class="formset_right">2024年7月1日制定</p>
                    </div>




<?php
$html = ob_get_clean();

// ホワイトスペース削除（tcpdfで出来る限り正しい改行位置を保持するために必要）
$html = removeWhiteSpace($html);

// 簡易フォーマット
$html = setNewLineBlockElementAfter($html);
$html = setNewLineBlockElementStartTagAfter($html);
$html = setIndent($html);
$html = setSupTag($html);

echo $html;

function removeWhiteSpace($html){
	$lines = explode("\n",$html);
	foreach($lines as $i => $line){
		$lines[$i] = trim($line);
	}
	$html = str_replace('> <','><',implode(" ",$lines));
	return $html;
}

function setNewLineBlockElementStartTagAfter($html){
	$blockElements = [
		'article',
		'aside',
		'dd',
		'div',
		'dl',
		'dt',
		'fieldset',
		'figcaption',
		'figure',
		'footer',
		'form',
		'header',
		//'li',
		'main',
		'nav',
		'noscript',
		'ol',
		'pre',
		'section',
		'table',
		'tfoot',
		'ul',
		'video'
	];
	foreach($blockElements as $element){
		$html = preg_replace('/<'.$element.'(.*?)>/',"<".$element."$1>\n",$html);
		$html = preg_replace('/([\s\d\w\p{Hiragana}\p{Katakana}\p{Han}])<'.$element.'/',"$1\n<".$element,$html);
	}
	return $html;
}

function setNewLineBlockElementAfter($html){
	$blockElements = [
		'address',
		'article',
		'aside',
		'blockquote',
		'canvas',
		'dd',
		'div',
		'dl',
		'dt',
		'fieldset',
		'figcaption',
		'figure',
		'footer',
		'form',
		'h1',
		'h2',
		'h3',
		'h4',
		'h5',
		'h6',
		'header',
		'hr',
		'li',
		'main',
		'nav',
		'noscript',
		'ol',
		'p',
		'pre',
		'section',
		'table',
		'tfoot',
		'ul',
		'video'
	];
	foreach($blockElements as $element){
		$html = str_replace("</{$element}>","</{$element}>\n",$html);
	}
	return $html;
}

// 簡易フォーマット
function setIndent($html){
	$lines = explode("\n",$html);
	$switch = [];
	$depth = 0;
	foreach($lines as $i => $line){

		$lines[$i] = preg_replace('/^\s+$/','',$lines[$i]);

		// n階層に入る
		if(preg_match('/^<([\d\w]+?)(?: |>)/',$line,$m1)){
			array_push($switch,'</'.$m1[1].'>');
			$depth++;
		}

		// n階層分のインデント
		$lines[$i] = $lines[$i] ? str_repeat("  ",$depth).$lines[$i] : $lines[$i];

		// n階層を抜ける
		foreach($switch as $index => $endTag){
			$tag = str_replace('/','\/',$endTag);
			if(preg_match('/'.$tag.'/',$line)){
				unset($switch[$index]);
				$depth--;
				break;
			}
		}

		// デバッグ用
		//$lines[$i] = $lines[$i] ? $lines[$i] . '<!--'.$depth.'('.count($switch).'::'.implode(',',$switch).')-->' : $lines[$i];
	}

	$html = implode("\n",$lines);
	return $html;
}

function setSupTag($html){
	$html = str_replace('Scientist<span>3</span>','Scientist<sup>3</sup>',$html);
	$html = str_replace('Scientist<span class="txt_up">3</span>','Scientist<sup>3</sup>',$html);
	return $html;
}

?>

